In [1]:
# Pandas contains data structures and data manipulation tools
# designed to make data cleaning and analysis fast and easy in Python. 
# While pandas adopts many coding idioms from NumPy, 
# the biggest difference is that pandas is designed
# for working with tabular or heterogeneous data.
# NumPy, by contrast, is best suited for working with homogeneous numerical array data.

In [2]:
# Introduction to pandas Data Structures.

In [21]:
import pandas as pd
import numpy as np

In [ ]:
# Series
# A Series is a one-dimensional array-like object containing a sequence of values
# (of similar types to NumPy types) and an associated array of data labels, called its index.

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# Often it will be desirable to create a Series with an index identifying each data point
# with a label:
obj2 = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])

In [9]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [10]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
# Compared with NumPy arrays, you can use labels in the index when selecting
# single values or a set of values:
obj2['a']

4

In [12]:
obj[1]

7

In [14]:
obj2[['c', 'a', 'd']] # Here ['c', 'a', 'd'] is interpreted as a list of indices,
                      # even though it contains strings instead of integers.

c   -5
a    4
d    3
dtype: int64

In [16]:
obj > 3

0     True
1     True
2    False
3    False
dtype: bool

In [17]:
obj[obj > 3]

0    4
1    7
dtype: int64

In [18]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [19]:
pd.exp

AttributeError: module 'pandas' has no attribute 'exp'

In [22]:
np.exp(obj)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
dtype: float64

In [32]:
# you can create a Series from a python dict:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [35]:
obj4 = pd.Series(sdata, index=states)

In [37]:
# Here, three values found in sdata were placed in the appropriate locations,
# but since no value for 'California' was found, it appears as NaN (not a number),
# which is con‐ sidered in pandas to mark missing or NA values.
# Since 'Utah' was not included in states, it is excluded from the resulting object.
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [39]:
# I will use the terms “missing” or “NA” interchangeably to refer to missing data.
# The isnull and notnull functions in pandas should be used to detect missing data:
pd.isnull(obj4) # or obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [40]:
pd.notnull(obj4) # or obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [42]:
# A useful Series feature for many applications is that it automatically aligns by index
# label in arithmetic operations:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [44]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [47]:
# Both the Series object itself and its index have a name attribute,
# which integrates with other key areas of pandas functionality:
obj4.name = 'population'

In [48]:
obj4.index.name = 'state'

In [49]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
# A Series’s index can be altered in-place by assignment:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [52]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [53]:
# DataFrame

In [54]:
# A DataFrame represents a rectangular table of data and contains an ordered collection
# of columns, each of which can be a different value type (numeric, string, boolean, etc.).

In [55]:
# There are many ways to construct a DataFrame, though one of the most common
# is from a dict of equal-length lists or NumPy arrays:

In [56]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
       }

In [57]:
frame = pd.DataFrame(data)

In [58]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [59]:
# For large DataFrames, the head method selects only the first five rows:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [60]:
# If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [61]:
pd.DataFrame(data, columns=['pop', 'year', 'state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

In [62]:
# If you pass a column that isn’t contained in the dict,
# it will appear with missing values in the result:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])

In [63]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [64]:
# A column in a DataFrame can be retrieved as a Series 
# either by dict-like notation or by attribute:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [65]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [68]:
# retrieving the whole columns
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [69]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [70]:
# Columns can be modified by assignment.
# For example, the empty 'debt' column could be assigned a scalar value or an array of values:
frame2['debt'] = 16.5

In [77]:
frame2['debt'] = np.arange(6.)

In [78]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [79]:
# When you are assigning lists or arrays to a column,
# the value’s length must match the length of the DataFrame.
# If you assign a Series, its labels will be realigned exactly to the DataFrame’s index,
# inserting missing values in any holes:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [80]:
frame2['debt'] = val

In [81]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [83]:
# Assigning a column that doesn’t exist will create a new column.
# The del keyword will delete columns as with a dict.
# As an example of del, I first add a new column of boolean values
# where the state column equals 'Ohio':
frame2['eastern'] = frame2.state == 'Ohio'

In [84]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [85]:
# NOTE: New columns cannot be created with the frame2.eastern syntax.

In [87]:
# The del method can then be used to remove this column:
del frame2['eastern']

In [88]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [89]:
# Another common form of data is a nested dict of dicts:
pop = {
    'Nevada': { 2001: 2.4, 2002: 2.9 },
    'Ohio': { 2000: 1.5, 2001: 1.7, 2002: 3.6 }
}
# If the nested dict is passed to the DataFrame,
# pandas will interpret the outer dict keys as the columns
# and the inner keys as the row indices:
frame3 = pd.DataFrame(pop)

In [90]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [91]:
# You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5